esp-cpp/espp/components/esp32-p4-wifi6-dev-kit/src/video.cpp
#include "esp32-p4-wifi6-dev-kit.hpp"

#include "esp_idf_version.h"
#ifndef ESP_IDF_VERSION_VAL
#define ESP_IDF_VERSION_VAL(major, minor, patch) (((major) << 16) | ((minor) << 8) | (patch))
#endif
#ifndef ESP_IDF_VERSION
#define ESP_IDF_VERSION ESP_IDF_VERSION_VAL(0, 0, 0)
#endif

#include <algorithm>
#include <array>
#include <cstdlib>
#include <cstring>
#include <thread>

#include <driver/gpio.h>
#include <esp_heap_caps.h>
#include <esp_lcd_mipi_dsi.h>
#include <esp_lcd_panel_interface.h>
#include <esp_lcd_panel_io.h>
#include <esp_lcd_panel_ops.h>
#include <esp_ldo_regulator.h>

using namespace std::chrono_literals;

namespace espp {

bool Esp32P4Wifi6DevKit::initialize_lcd() {
  // Idempotent: once the DPI panel is streaming, the vendor-command channel can
  // no longer drain, so re-entering the init/vendor-command path would hang.
  if (lcd_initialized_) {
    logger_.warn("LCD already initialized; ignoring repeat initialize_lcd()");
    return true;
  }
  logger_.info("Initializing LCD (MIPI-DSI)");

  // Select the panel params first: the DSI lane bit rate is per-panel.
  apply_panel_params(default_controller_);

  esp_err_t ret = ESP_OK;

  // Enable the MIPI DSI PHY power LDO (on-chip LDO_VO3 -> VDD_MIPI_DPHY,
  // channel 3 @ 2500 mV on the ESP32-P4-WIFI6-DEV-KIT).
  static esp_ldo_channel_handle_t phy_pwr_chan = nullptr;
  if (phy_pwr_chan == nullptr) {
    esp_ldo_channel_config_t phy_pwr_cfg{};
    phy_pwr_cfg.chan_id = mipi_dsi_phy_ldo_channel;
    phy_pwr_cfg.voltage_mv = mipi_dsi_phy_ldo_voltage_mv;
    ret = esp_ldo_acquire_channel(&phy_pwr_cfg, &phy_pwr_chan);
    if (ret != ESP_OK) {
      logger_.error("Failed to acquire MIPI DSI PHY power LDO channel: {}", esp_err_to_name(ret));
      return false;
    }
  }

  // NOTE: The ESP32-P4-WIFI6-DEV-KIT does not route a panel reset GPIO for either panel;
  // the panel is reset over DSI during its vendor init sequence, so there is no
  // hardware GPIO reset step here (unlike the ESP32-P4-Function-EV-Board).

  // The 10.1" JD9365 panel is powered/reset and backlit by an on-board I2C
  // controller (addr 0x45) on the BSP's internal I2C bus: register 0x95 is the
  // panel power/reset control and 0x96 the backlight level (0-255) on this
  // panel's controller. This power-on sequence (values and delays) matches
  // Waveshare's vendor panel component and must run before any DSI traffic
  // so the panel is powered and out of reset when the vendor init sequence is
  // sent.
  if (display_controller_ == DisplayController::JD9365) {
    // Lazily create the backlight/panel-power I2C device on the internal bus
    // (shared with brightness()).
    if (!backlight_i2c_device_) {
      std::error_code ec;
      backlight_i2c_device_ = internal_i2c_.add_device<uint8_t>(
          {
              .device_address = backlight_i2c_address,
              .timeout_ms = static_cast<int>(internal_i2c_.config().timeout_ms),
              .scl_speed_hz = internal_i2c_.config().clk_speed,
              .log_level = espp::Logger::Verbosity::WARN,
          },
          ec);
      if (!backlight_i2c_device_) {
        logger_.error("Could not initialize panel power/backlight I2C device (0x{:02X}): {}",
                      backlight_i2c_address, ec.message());
        return false;
      }
    }
    auto write_panel_reg = [this](uint8_t reg, uint8_t value) -> bool {
      const uint8_t data[2] = {reg, value};
      std::error_code ec;
      if (!backlight_i2c_device_->write(data, sizeof(data), ec)) {
        logger_.error("Failed to write panel power controller reg 0x{:02X}: {}", reg, ec.message());
        return false;
      }
      return true;
    };
    // Every write in this sequence is required: if the power/reset writes fail
    // the panel may still be unpowered/in reset when the DSI vendor init
    // sequence is sent, which fails or hangs non-deterministically later. Abort
    // LCD init instead of proceeding blind.
    if (!write_panel_reg(0x95, 0x11) || // panel power/reset control
        !write_panel_reg(0x95, 0x17) || // panel power/reset control
        !write_panel_reg(0x96, 0x00)) { // backlight off while powering up
      logger_.error("Failed to power on the JD9365 panel via its I2C power controller");
      return false;
    }
    std::this_thread::sleep_for(100ms);
    if (!write_panel_reg(0x96, 0xFF)) { // backlight full on
      logger_.error("Failed to enable the JD9365 panel backlight via its I2C power controller");
      return false;
    }
    std::this_thread::sleep_for(1000ms);
  }

  // Create the MIPI DSI bus (also initializes the DSI PHY)
  if (lcd_handles_.mipi_dsi_bus == nullptr) {
    logger_.info("Creating MIPI DSI bus ({} lanes, {} Mbps/lane)", mipi_dsi_lanes,
                 panel_params_.lane_bitrate_mbps);
    esp_lcd_dsi_bus_config_t bus_config = {};
    bus_config.bus_id = 0;
    bus_config.num_data_lanes = mipi_dsi_lanes;
    bus_config.phy_clk_src = MIPI_DSI_PHY_CLK_SRC_DEFAULT;
    bus_config.lane_bit_rate_mbps = panel_params_.lane_bitrate_mbps;
    ret = esp_lcd_new_dsi_bus(&bus_config, &lcd_handles_.mipi_dsi_bus);
    if (ret != ESP_OK) {
      logger_.error("New DSI bus init failed: {}", esp_err_to_name(ret));
      return false;
    }
  }

  // Install the DBI panel IO (used to send DCS commands/parameters)
  if (lcd_handles_.io == nullptr) {
    logger_.info("Installing MIPI DSI DBI panel IO");
    esp_lcd_dbi_io_config_t dbi_config = {};
    dbi_config.virtual_channel = 0;
    dbi_config.lcd_cmd_bits = 8;
    dbi_config.lcd_param_bits = 8;
    ret = esp_lcd_new_panel_io_dbi(lcd_handles_.mipi_dsi_bus, &dbi_config, &lcd_handles_.io);
    if (ret != ESP_OK) {
      logger_.error("New panel IO failed: {}", esp_err_to_name(ret));
      return false;
    }
  }

  // Select the panel (Kconfig-driven) and apply its parameters (geometry, DPI
  // timing).
  logger_.info("Using display panel: {} ({}x{})", get_display_controller_name(), display_width_,
               display_height_);

  // NOTE: The ESP32-P4-WIFI6-DEV-KIT has no backlight GPIO. The backlight is driven by an
  // on-board I2C controller (addr 0x45). On the 10.1" JD9365 panel brightness()
  // writes that controller (reg 0x96); on the other panels the panel powers up
  // with the backlight on and brightness() only stores the value. No espp::Led /
  // PWM backlight is instantiated here.
  brightness(100.0f);

