esp-cpp/espp/components/esp32-p4-wifi6-dev-kit/src/video.cpp
  // espp-driver path (JD9365 / ILI9881C / EK79007): send the panel
  // controller's vendor init sequence over DBI (command mode), before starting
  // the DPI video stream.
  espp::display_drivers::Config display_config{
      .panel_io = nullptr,
      .write_command = std::bind_front(&Esp32P4Wifi6DevKit::dsi_write_command, this),
      // NOTE: the Waveshare ESP32-P4 panels do not reliably support MIPI-DSI DCS
      // reads (bus turn-around); the ESP-IDF HAL busy-waits on the read, which
      // hangs panel init and trips the task watchdog. Do not provide a
      // read_command so the driver skips the optional panel-ID read.
      .read_command = nullptr,
      .lcd_send_lines = nullptr,
      .reset_pin = GPIO_NUM_NC,
      .data_command_pin = GPIO_NUM_NC,
      .reset_value = false,
      .invert_colors = invert_colors,
      .swap_color_order = swap_color_order,
      .offset_x = 0,
      .offset_y = 0,
      .swap_xy = swap_xy,
      .mirror_x = mirror_x,
      .mirror_y = mirror_y,
      .mirror_portrait = false,
  };

  display_driver_.reset();
  if (display_controller_ == DisplayController::JD9365) {
    // The Waveshare 10.1" 800x1280 panel is a JD9365. espp::Jd9365 performs
    // the DCS software reset and sends the vendor init sequence (taken from
    // Waveshare's vendor panel component; see jd9365.hpp) over the DBI IO.
    auto driver = std::make_shared<espp::Jd9365>(display_config);
    if (driver->initialize()) {
      display_driver_ = std::move(driver);
    }
  } else if (display_controller_ == DisplayController::ILI9881C) {
    auto driver = std::make_shared<espp::Ili9881>(display_config);
    if (driver->initialize()) {
      display_driver_ = std::move(driver);
    }
  } else {
    auto driver = std::make_shared<espp::Ek79007>(display_config);
    if (driver->initialize()) {
      display_driver_ = std::move(driver);
    }
  }
  if (!display_driver_) {
    logger_.error("Failed to initialize {} display controller", get_display_controller_name());
    return false;
  }

  // Create the DPI (video) panel with the configured panel's timing. This must
  // come AFTER the vendor init sequence above: esp_lcd_new_panel_dpi() starts the
  // HS video stream, and once it is running the DSI cannot drain the low-power
  // command FIFO, so a long init sequence (e.g. ILI9881C's 202 commands) would
  // overflow it and hang.
  if (lcd_handles_.panel == nullptr) {
    esp_lcd_dpi_panel_config_t dpi_cfg{};
    memset(&dpi_cfg, 0, sizeof(dpi_cfg));
    dpi_cfg.virtual_channel = 0;
    dpi_cfg.dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT;
    dpi_cfg.dpi_clock_freq_mhz = panel_params_.dpi_clock_freq_mhz;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
    dpi_cfg.in_color_format = LCD_COLOR_FMT_RGB565;
    dpi_cfg.out_color_format = LCD_COLOR_FMT_RGB565;
#else
    dpi_cfg.pixel_format = LCD_COLOR_PIXEL_FORMAT_RGB565;
    // DMA2D only on the JD9365 - same conditioning as the IDF >= 6.0 path
    // below (see the NOTE there: DMA2D corrupts the RGB565 channel order on
    // the ILI9881C / EK79007 panels).
    dpi_cfg.flags.use_dma2d = (display_controller_ == DisplayController::JD9365);
#endif
    dpi_cfg.num_fbs = 1;
    dpi_cfg.video_timing.h_size = display_width_;
    dpi_cfg.video_timing.v_size = display_height_;
    dpi_cfg.video_timing.hsync_pulse_width = panel_params_.hsync_pulse_width;
    dpi_cfg.video_timing.hsync_back_porch = panel_params_.hsync_back_porch;
    dpi_cfg.video_timing.hsync_front_porch = panel_params_.hsync_front_porch;
    dpi_cfg.video_timing.vsync_pulse_width = panel_params_.vsync_pulse_width;
    dpi_cfg.video_timing.vsync_back_porch = panel_params_.vsync_back_porch;
    dpi_cfg.video_timing.vsync_front_porch = panel_params_.vsync_front_porch;
    logger_.info("Creating DPI panel ({}x{} @ {} MHz)", dpi_cfg.video_timing.h_size,
                 dpi_cfg.video_timing.v_size, dpi_cfg.dpi_clock_freq_mhz);
    ret = esp_lcd_new_panel_dpi(lcd_handles_.mipi_dsi_bus, &dpi_cfg, &lcd_handles_.panel);
    if (ret != ESP_OK) {
      logger_.error("Failed to create MIPI DSI DPI panel: {}", esp_err_to_name(ret));
      return false;
    }
    // NOTE: for the ILI9881C / EK79007 panels we deliberately do NOT enable
    // DMA2D for the DPI panel. DMA2D is a color-processing engine, not a plain
    // copy: routing the LVGL flush (esp_lcd_panel_draw_bitmap) through it
    // corrupts the RGB565 channel order on those panels, while the plain CPU
    // copy path renders correctly. The JD9365 panel renders correctly WITH
    // DMA2D (and Waveshare's vendor panel component enables it), so keep it
    // enabled on that path.
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0)
    if (display_controller_ == DisplayController::JD9365) {
      ret = esp_lcd_dpi_panel_enable_dma2d(lcd_handles_.panel);
      if (ret != ESP_OK) {
        logger_.error("Failed to enable DMA2D for the DPI panel: {}", esp_err_to_name(ret));
        return false;
      }
    }
#endif
  }

  // Low-level panel init (starts the DPI video stream)
  ret = lcd_handles_.panel->init(lcd_handles_.panel);
  if (ret != ESP_OK) {
    logger_.error("Low-level panel init failed: {}", esp_err_to_name(ret));
    return false;
  }

  // Note: the raw MIPI-DSI DPI panel does not implement disp_on_off (the panel
  // is driven on by its vendor init + the DPI video stream), so we don't call
  // esp_lcd_panel_disp_on_off() here.

  // Register the DPI "color transfer done" callback so LVGL flush completes
  esp_lcd_dpi_panel_event_callbacks_t cbs = {
      .on_color_trans_done = &Esp32P4Wifi6DevKit::notify_lvgl_flush_ready,
      .on_refresh_done = nullptr,
  };
  ret = esp_lcd_dpi_panel_register_event_callbacks(lcd_handles_.panel, &cbs, this);
  if (ret != ESP_OK) {
    logger_.error("Failed to register panel event callback: {}", esp_err_to_name(ret));
    return false;
  }

  logger_.info("LCD initialization completed ({})", get_display_controller_name());
  lcd_initialized_ = true;
  return true;
}

void Esp32P4Wifi6DevKit::apply_panel_params(DisplayController controller) {
  display_controller_ =
      (controller == DisplayController::UNKNOWN) ? default_controller_ : controller;
  switch (display_controller_) {
  case DisplayController::JD9365:
    panel_params_ = JD9365_PARAMS;
    break;
  case DisplayController::ILI9881C:
    panel_params_ = ILI9881C_PARAMS;
    break;
  default:
    panel_params_ = EK79007_PARAMS;
    break;
  }
  display_width_ = panel_params_.width;
  display_height_ = panel_params_.height;
}

bool Esp32P4Wifi6DevKit::initialize_display(size_t pixel_buffer_size) {
  if (pixel_buffer_size == 0) {
    pixel_buffer_size = display_width_ * 50;
  }
  // Re-initialization contract: the LVGL display, its draw buffers, and the
  // rotation scratch buffer are created exactly once. Once display_ exists a
  // GUI/LVGL task may already be calling flush(), which reads
  // rotation_buffer_ without locking, so nothing may be freed / reallocated /
  // resized here after that point - refuse re-init instead. (LVGL's draw
  // buffers are also fixed at first init, so a different pixel_buffer_size
  // could not take effect anyway.)
  if (display_) {
    logger_.warn("Display already initialized; ignoring re-initialization request (the pixel "
                 "buffer size cannot be changed after the first call)");
    return true;
  }
  logger_.info("Initializing LVGL display with pixel buffer size: {} pixels", pixel_buffer_size);

