esp-cpp/espp/components/esp32-p4-wifi6-dev-kit/src/video.cpp
  // Rotation scratch buffer (only used when the display is rotated). Allocate
  // it BEFORE creating display_: flush() can only run once display_ exists, so
  // this ordering (plus the re-init guard above) guarantees flush() never
  // observes the buffer changing. An allocation failure fails display
  // initialization outright: rotation can be enabled at any time later via
  // lv_display_set_rotation() (there is no way to lock it off at the LVGL
  // level), and without this buffer flush() would have to either send
  // unrotated pixels at rotated coordinates (garbage on screen) or silently
  // drop every flush - neither is an acceptable "working" display.
  if (rotation_buffer_ == nullptr) {
    rotation_buffer_ = (uint16_t *)heap_caps_malloc(pixel_buffer_size * sizeof(uint16_t),
                                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (rotation_buffer_ == nullptr) {
      logger_.error("Could not allocate the {}-byte display rotation buffer; failing display "
                    "initialization",
                    pixel_buffer_size * sizeof(uint16_t));
      return false;
    }
    rotation_buffer_px_ = pixel_buffer_size;
  }

  display_ = std::make_shared<Display<Pixel>>(
      Display<Pixel>::LvglConfig{.width = display_width_,
                                 .height = display_height_,
                                 .flush_callback =
                                     std::bind_front(&Esp32P4Wifi6DevKit::flush, this),
                                 .rotation_callback = nullptr,
                                 .rotation = rotation},
      Display<Pixel>::OledConfig{
          .set_brightness_callback =
              [this](float brightness) { this->brightness(brightness * 100.0f); },
          .get_brightness_callback = [this]() { return this->brightness() / 100.0f; }},
      Display<Pixel>::DynamicMemoryConfig{
          .pixel_buffer_size = pixel_buffer_size,
          .double_buffered = true,
          // Allocate the LVGL draw buffers in PSRAM to keep these large buffers
          // out of internal SRAM. The CPU-copy flush reads them coherently.
          .allocation_flags = MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT,
      },
      Logger::Verbosity::WARN);

  logger_.info("LVGL display initialized");
  return true;
}

lv_display_rotation_t Esp32P4Wifi6DevKit::current_display_rotation() const {
  // Query the BSP-managed display, not lv_display_get_default(): if the app
  // creates additional LVGL displays the default may not be this panel.
  if (display_) {
    return lv_display_get_rotation(display_->get_lvgl_display());
  }
  // Before initialize_display() there is no LVGL display yet; report the
  // rotation it will be created with.
  return static_cast<lv_display_rotation_t>(rotation);
}

size_t Esp32P4Wifi6DevKit::rotated_display_width() const {
  auto rot = current_display_rotation();
  switch (rot) {
  case LV_DISPLAY_ROTATION_90:
  case LV_DISPLAY_ROTATION_270:
    return display_height_;
  default:
    return display_width_;
  }
}

size_t Esp32P4Wifi6DevKit::rotated_display_height() const {
  auto rot = current_display_rotation();
  switch (rot) {
  case LV_DISPLAY_ROTATION_90:
  case LV_DISPLAY_ROTATION_270:
    return display_width_;
  default:
    return display_height_;
  }
}

void Esp32P4Wifi6DevKit::write_lcd_lines(int xs, int ys, int xe, int ye, const uint8_t *data,
                                         uint32_t user_data) {
  (void)user_data;
  if (lcd_handles_.panel == nullptr || data == nullptr) {
    return;
  }
  if (xs < 0 || ys < 0 || xe < xs || ye < ys) {
    logger_.error("write_lcd_lines: Bad region: ({},{}) to ({},{})", xs, ys, xe, ye);
    return;
  }
  esp_err_t err = esp_lcd_panel_draw_bitmap(lcd_handles_.panel, xs, ys, xe + 1, ye + 1, data);
  if (err != ESP_OK) {
    logger_.error("write_lcd_lines: esp_lcd_panel_draw_bitmap failed: {}", esp_err_to_name(err));
  }
}

void Esp32P4Wifi6DevKit::brightness(float brightness) {
  // The ESP32-P4-WIFI6-DEV-KIT has NO backlight GPIO. The backlight is driven by an
  // on-board I2C controller at address 0x45. On the 10.1" JD9365 panel the
  // brightness register is 0x96 (value 0-255); Waveshare's own BSP writes 0x86
  // instead for some panel revisions. For panels other than the JD9365 the
  // chip/protocol has not been verified, so this remains best-effort: store
  // the requested value so brightness() reads back what was set, and log it.
  brightness = std::clamp(brightness, 0.0f, 100.0f);
  brightness_ = brightness;
  if (display_controller_ != DisplayController::JD9365) {
    logger_.debug("brightness({}) requested; no backlight GPIO on this board (on-board I2C "
                  "backlight protocol not verified for this panel), value stored only",
                  brightness);
    return;
  }
  // Lazily create the backlight I2C device on the internal bus.
  if (!backlight_i2c_device_) {
    std::error_code ec;
    backlight_i2c_device_ = internal_i2c_.add_device<uint8_t>(
        {
            .device_address = backlight_i2c_address,
            .timeout_ms = static_cast<int>(internal_i2c_.config().timeout_ms),
            .scl_speed_hz = internal_i2c_.config().clk_speed,
            .log_level = espp::Logger::Verbosity::WARN,
        },
        ec);
    if (!backlight_i2c_device_) {
      logger_.error("Could not initialize backlight I2C device (0x{:02X}): {}",
                    backlight_i2c_address, ec.message());
      return;
    }
  }
  // Register 0x96 is the brightness register (0-255) on the 10.1" JD9365
  // panel's power/backlight controller (Waveshare's BSP uses 0x86 for some
  // panel revisions).
  const uint8_t data[2] = {0x96, static_cast<uint8_t>(255.0f * brightness / 100.0f)};
  std::error_code ec;
  if (!backlight_i2c_device_->write(data, sizeof(data), ec)) {
    logger_.error("Failed to write backlight brightness: {}", ec.message());
  }
}

float Esp32P4Wifi6DevKit::brightness() const { return brightness_.load(); }

// NOTE: this is the LVGL flush_cb; LVGL only ever invokes it from the task that
// runs lv_timer_handler() (the espp::Display update task), never from an ISR,
// so it is deliberately NOT IRAM_ATTR and is free to call LVGL / esp_lcd
// task-context APIs (lv_draw_sw_rotate, esp_lcd_panel_draw_bitmap, logging).
void Esp32P4Wifi6DevKit::flush(lv_display_t *disp, const lv_area_t *area, uint8_t *px_map) {
  if (lcd_handles_.panel == nullptr) {
    lv_display_flush_ready(disp);
    return;
  }

