esp-cpp/espp/components/esp32-p4-wifi6-dev-kit/src/video.cpp
  int offsetx1 = area->x1;
  int offsetx2 = area->x2;
  int offsety1 = area->y1;
  int offsety2 = area->y2;

  // Use the display being flushed (the BSP-managed one), not
  // lv_display_get_default(): another LVGL display created by the app could be
  // the default, and its rotation must not leak into this panel's flush.
  auto rot = lv_display_get_rotation(disp);
  int32_t ww = lv_area_get_width(area);
  int32_t hh = lv_area_get_height(area);
  if (rot > LV_DISPLAY_ROTATION_0) {
    // The scratch buffer was sized to the LVGL draw-buffer pixel count (and
    // initialize_display() fails if it cannot be allocated), so any flushed
    // area fits; this check is defense-in-depth. If rotation is ever
    // impossible, DROP the flush instead of falling back to unrotated data:
    // the area is transformed to rotated (physical) coordinates below, and
    // unrotated pixels at rotated coordinates would draw garbage.
    if (rotation_buffer_ == nullptr ||
        static_cast<size_t>(ww) * static_cast<size_t>(hh) > rotation_buffer_px_) {
      static uint32_t rotation_drop_count = 0;
      if ((rotation_drop_count++ % 100) == 0) {
        logger_.error(
            "flush: cannot rotate a {}x{} area (scratch buffer holds {} px); dropping the "
            "flush (occurrence {})",
            ww, hh, rotation_buffer_px_, rotation_drop_count);
      }
      lv_display_flush_ready(disp);
      return;
    }
    lv_color_format_t cf = lv_display_get_color_format(disp);
    uint32_t w_stride = lv_draw_buf_width_to_stride(ww, cf);
    uint32_t h_stride = lv_draw_buf_width_to_stride(hh, cf);
    if (rot == LV_DISPLAY_ROTATION_180) {
      // 180° keeps the source dimensions (unlike 90/270), so pass ww/hh and the
      // width-based stride for both source and destination.
      lv_draw_sw_rotate(px_map, rotation_buffer_, ww, hh, w_stride, w_stride,
                        LV_DISPLAY_ROTATION_180, cf);
    } else if (rot == LV_DISPLAY_ROTATION_90) {
      lv_draw_sw_rotate(px_map, rotation_buffer_, ww, hh, w_stride, h_stride,
                        LV_DISPLAY_ROTATION_90, cf);
    } else if (rot == LV_DISPLAY_ROTATION_270) {
      lv_draw_sw_rotate(px_map, rotation_buffer_, ww, hh, w_stride, h_stride,
                        LV_DISPLAY_ROTATION_270, cf);
    }
    px_map = reinterpret_cast<uint8_t *>(rotation_buffer_);
    // Rotate a local copy of the area; LVGL provides a const area* and mutating
    // it via const_cast would be undefined behavior.
    lv_area_t rotated = *area;
    lv_display_rotate_area(disp, &rotated);
    offsetx1 = rotated.x1;
    offsetx2 = rotated.x2;
    offsety1 = rotated.y1;
    offsety2 = rotated.y2;
  }

  esp_err_t err = esp_lcd_panel_draw_bitmap(lcd_handles_.panel, offsetx1, offsety1, offsetx2 + 1,
                                            offsety2 + 1, px_map);
  if (err != ESP_OK) {
    logger_.error("flush: esp_lcd_panel_draw_bitmap failed: {}", esp_err_to_name(err));
    // A failed draw never generates the on_color_trans_done callback, so mark
    // the flush ready here; otherwise LVGL would wait on this flush forever
    // and rendering would stall.
    lv_display_flush_ready(disp);
  }
}

// NOTE: this DPI on_color_trans_done callback runs in one of two contexts
// (see esp_lcd_panel_dpi.c): directly from esp_lcd_panel_draw_bitmap() in the
// calling task (CPU-copy path, ILI9881C/EK79007), or from the DMA2D
// transfer-done ISR (JD9365, where DMA2D is enabled). It must therefore be
// ISR-safe: the only work done here is a couple of null checks and
// Display::notify_flush_ready() -> lv_display_flush_ready(), which just clears
// the display's `flushing` flag (no locking/allocation/logging; LVGL provides
// LV_ATTRIBUTE_FLUSH_READY for exactly this use). It is kept IRAM_ATTR so it
// still satisfies the esp_ptr_in_iram() check esp_lcd performs on registration
// when CONFIG_LCD_DSI_ISR_CACHE_SAFE is enabled. No task is woken here, so the
// correct "yield required" return value is always false.
bool IRAM_ATTR Esp32P4Wifi6DevKit::notify_lvgl_flush_ready(esp_lcd_panel_handle_t panel,
                                                           esp_lcd_dpi_panel_event_data_t *edata,
                                                           void *user_ctx) {
  (void)panel;
  (void)edata;
  auto *board = static_cast<espp::Esp32P4Wifi6DevKit *>(user_ctx);
  if (board && board->display_) {
    board->display_->notify_flush_ready();
  }
  return false; // no high-priority task was woken
}

void Esp32P4Wifi6DevKit::dsi_write_command(uint8_t cmd, std::span<const uint8_t> params,
                                           uint32_t /*flags*/) {
  if (!lcd_handles_.io) {
    logger_.error("DSI write_command does not have a valid IO handle");
    return;
  }
  esp_err_t err =
      esp_lcd_panel_io_tx_param(lcd_handles_.io, (int)cmd, params.data(), params.size());
  if (err != ESP_OK) {
    logger_.error("DSI write_command 0x{:02X} failed: {}", cmd, esp_err_to_name(err));
  }
}

void Esp32P4Wifi6DevKit::dsi_read_command(uint8_t cmd, std::span<uint8_t> data,
                                          uint32_t /*flags*/) {
  if (!lcd_handles_.io) {
    logger_.error("DSI read_command does not have a valid IO handle");
    return;
  }
  esp_err_t err = esp_lcd_panel_io_rx_param(lcd_handles_.io, (int)cmd, data.data(), data.size());
  if (err != ESP_OK) {
    logger_.error("DSI read_command 0x{:02X} failed: {}", cmd, esp_err_to_name(err));
  }
}

} // namespace espp
